Revit 2027 API
BuiltInFailures.DebugTabBindingFailures Class
 Failures related to binding framework demo panel on Ribbon Debug Tab.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DebugTabBindingFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DebugTabBindingFailures
Public NotInheritable Class DebugTabBindingFailures
public ref class DebugTabBindingFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DebugTabBindingFailures = class end
The BuiltInFailures.DebugTabBindingFailures type exposes the following members.
Properties
Name | Description
OptionValueOutOfRange |  Value out of range for Options enum.
Top
See Also
Reference
Autodesk.Revit.DB Namespace